
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>git命令 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Git将一个项目同时从本地推送到GitHub和Gitee.html" />
    
    
    <link rel="prev" href="gitHub、gitee、Pages+Actions打造学习笔记.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="gitbook.html">
            
                <a href="gitbook.html">
            
                    
                    Gitbook
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="gitHub、gitee、Pages+Actions打造学习笔记.html">
            
                <a href="gitHub、gitee、Pages+Actions打造学习笔记.html">
            
                    
                    gitHub、gitee、Pages+Actions打造学习笔记
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="git命令.html">
            
                <a href="git命令.html">
            
                    
                    git命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Git将一个项目同时从本地推送到GitHub和Gitee.html">
            
                <a href="Git将一个项目同时从本地推送到GitHub和Gitee.html">
            
                    
                    Git将一个项目同时从本地推送到GitHub和Gitee
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Git配置多个SSH-Key.html">
            
                <a href="Git配置多个SSH-Key.html">
            
                    
                    Git配置多个SSH-Key
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="如何将一个项目同时提交到GitHub和Gitee两个仓库.html">
            
                <a href="如何将一个项目同时提交到GitHub和Gitee两个仓库.html">
            
                    
                    如何将一个项目同时提交到GitHub和Gitee两个仓库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="巧用Github%20Action同步代码到Gitee.md">
            
                <span>
            
                    
                    巧用Github Action同步代码到Gitee
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="打造完美写作系统：Gitbook+Github%20Pages+Github Actions.md">
            
                <span>
            
                    
                    打造完美写作系统：Gitbook+Github Pages+Github Actions
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="搭建Gitbook%20Docker版.md">
            
                <span>
            
                    
                    搭建Gitbook Docker版
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >git命令</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x7248;&#x672C;&#x63A7;&#x5236;&#x662F;&#x4E00;&#x79CD;&#x8BB0;&#x5F55;&#x82E5;&#x5E72;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x53D8;&#x5316;,&#x4EE5;&#x4FBF;&#x5C06;&#x6765;&#x67E5;&#x9605;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x4FEE;&#x8BA2;&#x60C5;&#x51B5;&#x7684;&#x7CFB;&#x7EDF;.</p>
<p>&#x5173;&#x4E8E;&#x7248;&#x672C;&#x63A7;&#x5236;&#x5206;&#x4E3A;&#x4E09;&#x79CD;&#xFF1A;&#x672C;&#x5730;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;rcs&#xFF1B;&#x96C6;&#x4E2D;&#x5316;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;CVS&#x3001;SVN&#xFF1B;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;Git&#x3002;</p>
<p>Git&#x57FA;&#x7840;&#x8981;&#x70B9;</p>
<p>Git&#x548C;&#x5176;&#x5B83;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x4E3B;&#x8981;&#x5DEE;&#x522B;&#x5728;&#x4E8E;&#xFF1A;Git&#x53EA;&#x5173;&#x5FC3;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x7684;&#x6574;&#x4F53;&#x662F;&#x5426;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x5927;&#x591A;&#x6570;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x5219;&#x53EA;&#x5173;&#x5FC3;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x7684;&#x5177;&#x4F53;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5728;Git&#x5185;&#x90FD;&#x53EA;&#x6709;&#x4E09;&#x79CD;&#x72B6;&#x6001;&#xFF1A;&#x5DF2;&#x63D0;&#x4EA4;(committed)&#x3001;&#x5DF2;&#x4FEE;&#x6539;(modified)&#x548C;&#x5DF2;&#x6682;&#x5B58;(staged)&#x3002;&#x5DF2;&#x63D0;&#x4EA4;&#x8868;&#x793A;&#x8BE5;&#x6587;&#x4EF6;&#x5DF2;&#x7ECF;&#x88AB;&#x5B89;&#x5168;&#x5730;&#x4FDD;&#x5B58;&#x5728;&#x672C;&#x5730;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E86;&#xFF1B;&#x5DF2;&#x4FEE;&#x6539;&#x8868;&#x793A;&#x4FEE;&#x6539;&#x4E86;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#x4FDD;&#x5B58;&#xFF1B;&#x5DF2;&#x6682;&#x5B58;&#x8868;&#x793A;&#x628A;&#x5DF2;&#x4FEE;&#x6539;&#x7684;&#x6587;&#x4EF6;&#x653E;&#x5728;&#x4E0B;&#x6B21;&#x63D0;&#x4EA4;&#x65F6;&#x8981;&#x4FDD;&#x5B58;&#x7684;&#x6E05;&#x5355;&#x4E2D;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x6709;&#x4E00;&#x4E2A;git&#x76EE;&#x5F55;&#xFF0C;&#x5B83;&#x662F;Git&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x5143;&#x6570;&#x636E;&#x548C;&#x5BF9;&#x8C61;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8BE5;&#x76EE;&#x5F55;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x6BCF;&#x6B21;&#x514B;&#x9686;&#x955C;&#x50CF;&#x4ED3;&#x5E93;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B9E;&#x9645;&#x62F7;&#x8D1D;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x7684;&#x6682;&#x5B58;&#x533A;&#x57DF;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x653E;&#x5728;git&#x76EE;&#x5F55;&#x4E2D;&#x3002;&#x6709;&#x65F6;&#x5019;&#x4EBA;&#x4EEC;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x53EB;&#x505A;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x7684;Git&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF1A;(1)&#x3001;&#x5728;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E2D;&#x4FEE;&#x6539;&#x67D0;&#x4E9B;&#x6587;&#x4EF6;&#xFF1B;(2)&#x3001;&#x5BF9;&#x8FD9;&#x4E9B;&#x4FEE;&#x6539;&#x4E86;&#x7684;&#x6587;&#x4EF6;&#x4F5C;&#x5FEB;&#x7167;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x5230;&#x6682;&#x5B58;&#x533A;&#x57DF;&#xFF1B;(3)&#x3001;&#x63D0;&#x4EA4;&#x66F4;&#x65B0;&#xFF0C;&#x5C06;&#x4FDD;&#x5B58;&#x5728;&#x6682;&#x5B58;&#x533A;&#x57DF;&#x7684;&#x6587;&#x4EF6;&#x5FEB;&#x7167;&#x8F6C;&#x50A8;&#x5230;git&#x76EE;&#x5F55;&#x4E2D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5DF2;&#x5B89;&#x88C5;&#x7684;Git&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x8981;&#x914D;&#x7F6E;&#x7684;&#x662F;&#x4F60;&#x4E2A;&#x4EBA;&#x7684;&#x7528;&#x6237;&#x540D;&#x79F0;&#x548C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x4E24;&#x6761;&#x914D;&#x7F6E;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6BCF;&#x6B21;Git&#x63D0;&#x4EA4;&#x65F6;&#x90FD;&#x4F1A;&#x5F15;&#x7528;&#x8FD9;&#x4E24;&#x6761;&#x4FE1;&#x606F;&#xFF0C;&#x8BF4;&#x660E;&#x662F;&#x8C01;&#x63D0;&#x4EA4;&#x4E86;&#x66F4;&#x65B0;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x968F;&#x66F4;&#x65B0;&#x5185;&#x5BB9;&#x4E00;&#x8D77;&#x88AB;&#x6C38;&#x4E45;&#x7EB3;&#x5165;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#xFF1A;</p>
<p><code>$ git config --global user.name &quot;Spring&quot;</code>
<code>$ git config --global user.email Spring@163.com</code>
&#x5982;&#x679C;&#x7528;&#x4E86;--global&#x9009;&#x9879;&#xFF0C;&#x90A3;&#x4E48;&#x66F4;&#x6539;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5C31;&#x662F;&#x4F4D;&#x4E8E;&#x4F60;&#x7528;&#x6237;&#x4E3B;&#x76EE;&#x5F55;&#x7684;&#x90A3;&#x4E2A;&#xFF0C;&#x4EE5;&#x540E;&#x4F60;&#x6240;&#x6709;&#x7684;&#x9879;&#x76EE;&#x90FD;&#x4F1A;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x8FD9;&#x91CC;&#x914D;&#x7F6E;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x8981;&#x5728;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x540D;&#x5B57;&#x6216;&#x8005;&#x7535;&#x90AE;&#xFF0C;&#x53EA;&#x8981;&#x53BB;&#x6389;--global&#x9009;&#x9879;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x5373;&#x53EF;&#xFF0C;&#x65B0;&#x7684;&#x8BBE;&#x5B9A;&#x4FDD;&#x5B58;&#x5728;&#x5F53;&#x524D;&#x9879;&#x76EE;&#x7684;./git/config&#x6587;&#x4EF6;&#x91CC;&#x3002;</p>
<p>Git&#x5E38;&#x7528;&#x547D;&#x4EE4;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x53D6;&#x5F97;Git&#x9879;&#x76EE;&#x4ED3;&#x5E93;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x5728;&#x73B0;&#x5B58;&#x7684;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x5BFC;&#x5165;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x6765;&#x521B;&#x5EFA;&#x65B0;&#x7684;Git&#x4ED3;&#x5E93;&#xFF1A;(1)&#x3001;&#x4ECE;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x521D;&#x59CB;&#x5316;&#xFF1A;$ git init ,&#x521D;&#x59CB;&#x5316;&#x540E;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;.git&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x6240;&#x6709;Git&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x548C;&#x8D44;&#x6E90;&#x90FD;&#x5B58;&#x653E;&#x5728;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E2D;&#xFF1B;(2)&#x3001;&#x5982;&#x679C;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x51E0;&#x4E2A;&#x6587;&#x4EF6;&#x60F3;&#x8981;&#x7EB3;&#x5165;&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x7528;git add&#x547D;&#x4EE4;&#x544A;&#x8BC9;Git&#x5F00;&#x59CB;&#x5BF9;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x4EA4;&#xFF1A;</p>
<p><code>$ git add README  
$ git commit -m &apos;initial project version&apos;</code> 
&#x5176;&#x4E2D;README&#x6587;&#x4EF6;&#x662F;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x3002;git add&#x540E;&#x53EF;&#x4EE5;&#x63A5;&#x8981;&#x8DDF;&#x8E2A;&#x7684;&#x6587;&#x4EF6;&#x6216;&#x76EE;&#x5F55;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x5982;&#x679C;&#x662F;&#x76EE;&#x5F55;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x8981;&#x9012;&#x5F52;&#x8DDF;&#x8E2A;&#x6240;&#x6709;&#x8BE5;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x4ECE;&#x5DF2;&#x6709;&#x7684;Git&#x4ED3;&#x5E93;&#x514B;&#x9686;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x955C;&#x50CF;&#x4ED3;&#x5E93;&#x6765;&#xFF0C;&#x5982;&#xFF1A;</p>
<p><code>$ git clone git://github.com/schacon/grit.git</code>
&#x5982;&#x679C;&#x5E0C;&#x671B;&#x5728;&#x514B;&#x9686;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x8981;&#x65B0;&#x5EFA;&#x7684;&#x9879;&#x76EE;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x6700;&#x540E;&#x6307;&#x5B9A;&#xFF1A;</p>
<p><code>$ git clone git://github.com/schacon/grit.git mygrit</code>
&#x552F;&#x4E00;&#x7684;&#x5DEE;&#x522B;&#x5C31;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#x65B0;&#x5EFA;&#x7684;&#x76EE;&#x5F55;&#x6210;&#x4E86;mygrit&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x90FD;&#x548C;&#x4E0A;&#x8FB9;&#x7684;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E0B;&#x9762;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x90FD;&#x4E0D;&#x5916;&#x4E4E;&#x4E24;&#x79CD;&#x72B6;&#x6001;&#xFF1A;&#x5DF2;&#x8DDF;&#x8E2A;&#x6216;&#x672A;&#x8DDF;&#x8E2A;&#x3002;&#x5DF2;&#x8DDF;&#x8E2A;&#x7684;&#x6587;&#x4EF6;&#x662F;&#x6307;&#x672C;&#x6765;&#x5C31;&#x88AB;&#x7EB3;&#x5165;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7BA1;&#x7406;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5728;&#x4E0A;&#x6B21;&#x5FEB;&#x7167;&#x4E2D;&#x6709;&#x5B83;&#x4EEC;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x53EF;&#x80FD;&#x662F;&#x672A;&#x66F4;&#x65B0;&#xFF0C;&#x5DF2;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x5DF2;&#x653E;&#x5165;&#x6682;&#x5B58;&#x533A;&#x3002;&#x800C;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x90FD;&#x5C5E;&#x4E8E;&#x672A;&#x8DDF;&#x8E2A;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x68C0;&#x67E5;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x72B6;&#x6001;&#xFF1A;</p>
<p><code>$ git status</code>
&#x5FFD;&#x7565;&#x67D0;&#x4E9B;&#x6587;&#x4EF6;&#xFF1A;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;.gitignore&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5217;&#x51FA;&#x8981;&#x5FFD;&#x7565;&#x7684;&#x6587;&#x4EF6;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x8981;&#x67E5;&#x770B;&#x5C1A;&#x672A;&#x6682;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x66F4;&#x65B0;&#x4E86;&#x54EA;&#x4E9B;&#x90E8;&#x5206; &#xFF0C;&#x4E0D;&#x52A0;&#x53C2;&#x6570;&#x76F4;&#x63A5;&#x8F93;&#x5165;&#xFF1A;</p>
<p><code>$ git diff</code>
&#x5355;&#x5355;git diff&#x4E0D;&#x8FC7;&#x662F;&#x663E;&#x793A;&#x8FD8;&#x6CA1;&#x6709;&#x6682;&#x5B58;&#x8D77;&#x6765;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FD9;&#x6B21;&#x5DE5;&#x4F5C;&#x548C;&#x4E0A;&#x6B21;&#x63D0;&#x4EA4;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x5982;&#x8981;&#x770B;&#x5DF2;&#x7ECF;&#x6682;&#x5B58;&#x8D77;&#x6765;&#x7684;&#x6587;&#x4EF6;&#x548C;&#x4E0A;&#x6B21;&#x63D0;&#x4EA4;&#x65F6;&#x7684;&#x5FEB;&#x7167;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#xFF1A;</p>
<p><code>$ git diff --cached</code>
&#x6BCF;&#x6B21;&#x51C6;&#x5907;&#x63D0;&#x4EA4;&#x524D;&#xFF0C;&#x5148;&#x7528;git status&#x770B;&#x4E0B;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x90FD;&#x5DF2;&#x7ECF;&#x6682;&#x5B58;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD0;&#x884C;&#x63D0;&#x4EA4;&#x547D;&#x4EE4;&#xFF1A;</p>
<p><code>$ git commit</code>
&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x542F;&#x52A8;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x4EE5;&#x4FBF;&#x8F93;&#x5165;&#x672C;&#x6B21;&#x63D0;&#x4EA4;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;-m&#x53C2;&#x6570;&#x540E;&#x8DDF;&#x63D0;&#x4EA4;&#x8BF4;&#x660E;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p><code>$ git commit -m &quot;commit message&quot;</code>
&#x63D0;&#x4EA4;&#x65F6;&#x8BB0;&#x5F55;&#x7684;&#x662F;&#x653E;&#x5728;&#x6682;&#x5B58;&#x533A;&#x57DF;&#x7684;&#x5FEB;&#x7167;&#xFF0C;&#x4EFB;&#x4F55;&#x8FD8;&#x672A;&#x6682;&#x5B58;&#x7684;&#x4ECD;&#x7136;&#x4FDD;&#x6301;&#x5DF2;&#x4FEE;&#x6539;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x6B21;&#x63D0;&#x4EA4;&#x65F6;&#x7EB3;&#x5165;&#x7248;&#x672C;&#x7BA1;&#x7406;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x63D0;&#x4EA4;&#x64CD;&#x4F5C;&#xFF0C;&#x90FD;&#x662F;&#x5BF9;&#x4F60;&#x9879;&#x76EE;&#x4F5C;&#x4E00;&#x6B21;&#x5FEB;&#x7167;&#xFF0C;&#x4EE5;&#x540E;&#x53EF;&#x4EE5;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x6216;&#x8005;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</p>
<p>&#x63D0;&#x4EA4;&#x66F4;&#x65B0;&#xFF1A;&#x73B0;&#x5728;&#x7684;&#x6682;&#x5B58;&#x533A;&#x57DF;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x59A5;&#x5F53;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x4E86;&#x3002;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x4E00;&#x5B9A;&#x8981;&#x786E;&#x8BA4;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x4FEE;&#x6539;&#x8FC7;&#x7684;&#x6216;&#x65B0;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x8FD8;&#x6CA1;&#x6709;git  add &#x8FC7;&#xFF0C;&#x5426;&#x5219;&#x63D0;&#x4EA4;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4F1A;&#x8BB0;&#x5F55;&#x8FD9;&#x4E9B;&#x8FD8;&#x6CA1;&#x6682;&#x5B58;&#x8D77;&#x6765;&#x7684;&#x53D8;&#x5316;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6BCF;&#x6B21;&#x51C6;&#x5907;&#x63D0;&#x4EA4;&#x524D;&#xFF0C;&#x5148;&#x7528;git  status &#x770B;&#x4E0B;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x90FD;&#x5DF2;&#x6682;&#x5B58;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FD0;&#x884C;&#x63D0;&#x4EA4;&#x547D;&#x4EE4;git  commit&#x3002;
&#x8DF3;&#x8FC7;&#x4F7F;&#x7528;&#x6682;&#x5B58;&#x533A;&#x57DF;&#xFF1A;&#x53EA;&#x8981;&#x5728;&#x63D0;&#x4EA4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;git  commit&#x52A0;&#x4E0A;-a&#x9009;&#x9879;&#xFF0C;Git&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x628A;&#x6240;&#x6709;&#x5DF2;&#x7ECF;&#x8DDF;&#x8E2A;&#x8FC7;&#x7684;&#x6587;&#x4EF6;&#x6682;&#x5B58;&#x8D77;&#x6765;&#x4E00;&#x5E76;&#x63D0;&#x4EA4;&#xFF0C;&#x4ECE;&#x800C;&#x8DF3;&#x8FC7;git  add&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x79FB;&#x9664;&#x6587;&#x4EF6;&#xFF1A;&#x8981;&#x4ECE;Git &#x4E2D;&#x79FB;&#x9664;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x4ECE;&#x5DF2;&#x8DDF;&#x8E2A;&#x6587;&#x4EF6;&#x6E05;&#x5355;&#x4E2D;&#x79FB;&#x9664;&#xFF08;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x662F;&#x4ECE;&#x6682;&#x5B58;&#x533A;&#x57DF;&#x79FB;&#x9664;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x4EA4;&#x3002;&#x53EF;&#x4EE5;&#x7528;git  rm &#x547D;&#x4EE4;&#x5B8C;&#x6210;&#x6B64;&#x9879;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x8FDE;&#x5E26;&#x4ECE;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E2D;&#x5220;&#x9664;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x4EE5;&#x540E;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x672A;&#x8DDF;&#x8E2A;&#x6587;&#x4EF6;&#x6E05;&#x5355;&#x4E2D;&#x4E86;&#xFF1A;</p>
<p><code>$ git rm README</code>
&#x5982;&#x679C;&#x5220;&#x9664;&#x4E4B;&#x524D;&#x4FEE;&#x6539;&#x8FC7;&#x5E76;&#x4E14;&#x5DF2;&#x7ECF;&#x653E;&#x5230;&#x6682;&#x5B58;&#x533A;&#x57DF;&#x7684;&#x8BDD;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x8981;&#x7528;&#x5F3A;&#x5236;&#x5220;&#x9664;&#x9009;&#x9879;&#x201D;-f&#x201D;&#xFF0C;&#x4EE5;&#x9632;&#x8BEF;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x540E;&#x4E22;&#x5931;&#x4FEE;&#x6539;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x79FB;&#x52A8;&#x6587;&#x4EF6;&#xFF1A;&#x8981;&#x5728;Git&#x4E2D;&#x5BF9;&#x6587;&#x4EF6;&#x6539;&#x540D;&#xFF1A;</p>
<p><code>$ git mv file_from file_to</code>
&#x5176;&#x5B9E;&#xFF0C;&#x8FD0;&#x884C;git  mv&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x8FD0;&#x884C;&#x4E86;&#x4E0B;&#x9762;&#x4E09;&#x6761;&#x547D;&#x4EE4;&#xFF1A;</p>
<p><code>$ mv file_from file_to</code>
<code>$ git rm file_from</code>
<code>$ git add file_to</code>
&#x67E5;&#x770B;&#x63D0;&#x4EA4;&#x5386;&#x53F2;&#xFF1A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;</p>
<p><code>$ git log</code>
&#x9ED8;&#x8BA4;&#x4E0D;&#x7528;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#x7684;&#x8BDD;&#xFF0C;git  log&#x4F1A;&#x6309;&#x63D0;&#x4EA4;&#x65F6;&#x95F4;&#x5217;&#x51FA;&#x6240;&#x6709;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x6700;&#x8FD1;&#x7684;&#x66F4;&#x65B0;&#x6392;&#x5728;&#x6700;&#x4E0A;&#x9762;&#x3002;</p>
<p>&#x5E38;&#x7528;&#x201D;-p&#x201D;&#x9009;&#x9879;&#x5C55;&#x5F00;&#x663E;&#x793A;&#x6BCF;&#x6B21;&#x63D0;&#x4EA4;&#x7684;&#x5185;&#x5BB9;&#x5DEE;&#x5F02;&#xFF0C;&#x7528;-2&#x5219;&#x4EC5;&#x663E;&#x793A;&#x6700;&#x8FD1;&#x7684;&#x4E24;&#x6B21;&#x66F4;&#x65B0;&#x3002;&#x201D;--stat&#x201D;&#x4EC5;&#x663E;&#x793A;&#x7B80;&#x8981;&#x7684;&#x589E;&#x6539;&#x884C;&#x6570;&#x7EDF;&#x8BA1;&#x3002;&#x201D;--pretty&#x201D;&#x9009;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x4E8E;&#x9ED8;&#x8BA4;&#x683C;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x5C55;&#x5F00;&#x63D0;&#x4EA4;&#x5386;&#x53F2;&#xFF0C;&#x6BD4;&#x5982;&#x7528;online&#x5C06;&#x6BCF;&#x4E2A;&#x63D0;&#x4EA4;&#x653E;&#x5728;&#x4E00;&#x884C;&#x663E;&#x793A;&#xFF1A;</p>
<p><code>$ git log --pretty=oneline</code>
&#x53E6;&#x5916;&#x8FD8;&#x6709;short&#x3001;full&#x3001;fuller&#x548C;format&#x53EF;&#x4EE5;&#x7528;</p>
<p> <code>git log --pretty=format:&quot;%h - %an, %ar : %s&quot;</code>&#x4E0B;&#x9762;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x5E38;&#x7528;&#x7684;&#x9009;&#x9879;&#x53CA;&#x5176;&#x91CA;&#x4E49;&#xFF1A;</p>
<pre><code>     &#x201C;-p&#x201D;:&#x6309;&#x8865;&#x4E01;&#x683C;&#x5F0F;&#x663E;&#x793A;&#x6BCF;&#x4E2A;&#x66F4;&#x65B0;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;
</code></pre><p>&#x201C;--stat&#x201D;: &#x663E;&#x793A;&#x6BCF;&#x6B21;&#x66F4;&#x65B0;&#x7684;&#x6587;&#x4EF6;&#x4FEE;&#x6539;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x201C;--shortstat&#x201D;: &#x53EA;&#x663E;&#x793A;--stat &#x4E2D;&#x6700;&#x540E;&#x7684;&#x884C;&#x6570;&#x4FEE;&#x6539;&#x6DFB;&#x52A0;&#x79FB;&#x9664;&#x7EDF;&#x8BA1;&#x3002;</p>
<p>&#x201C;--name-only&#x201D;: &#x4EC5;&#x5728;&#x63D0;&#x4EA4;&#x4FE1;&#x606F;&#x540E;&#x663E;&#x793A;&#x5DF2;&#x4FEE;&#x6539;&#x7684;&#x6587;&#x4EF6;&#x6E05;&#x5355;&#x3002;</p>
<p>&#x201C;--name-status&#x201D;:&#x663E;&#x793A;&#x65B0;&#x589E;&#x3001;&#x4FEE;&#x6539;&#x3001;&#x5220;&#x9664;&#x7684;&#x6587;&#x4EF6;&#x6E05;&#x5355;&#x3002;</p>
<p>&#x201C;--abbrev-commit&#x201D;:&#x4EC5;&#x663E;&#x793A;SHA-1 &#x7684;&#x524D;&#x51E0;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x800C;&#x975E;&#x6240;&#x6709;&#x7684;40 &#x4E2A;&#x5B57;&#x7B26;&#x3002;</p>
<p>&#x201C;--relative-date&#x201D;:&#x4F7F;&#x7528;&#x8F83;&#x77ED;&#x7684;&#x76F8;&#x5BF9;&#x65F6;&#x95F4;&#x663E;&#x793A;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x201C;2 weeks ago&#x201D;&#xFF09;&#x3002;</p>
<p>&#x201C;--graph&#x201D;: &#x663E;&#x793A;ASCII &#x56FE;&#x5F62;&#x8868;&#x793A;&#x7684;&#x5206;&#x652F;&#x5408;&#x5E76;&#x5386;&#x53F2;&#x3002;</p>
<p>&#x201C;--pretty&#x201D;: &#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x683C;&#x5F0F;&#x663E;&#x793A;&#x5386;&#x53F2;&#x63D0;&#x4EA4;&#x4FE1;&#x606F;&#x3002;&#x53EF;&#x7528;&#x7684;&#x9009;&#x9879;&#x5305;&#x62EC;oneline&#xFF0C;short&#xFF0C;full&#xFF0C;fuller &#x548C;format&#xFF08;&#x540E;&#x8DDF;&#x6307;&#x5B9A;&#x683C;&#x5F0F;&#xFF09;&#x3002;</p>
<p>&#x201C;-(n)&#x201D;: &#x4EC5;&#x663E;&#x793A;&#x6700;&#x8FD1;&#x7684;n &#x6761;&#x63D0;&#x4EA4;</p>
<p>--since,--after: &#x4EC5;&#x663E;&#x793A;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x7684;&#x63D0;&#x4EA4;&#xFF0C;$ git log --since=2.weeks</p>
<p>--until,--before: &#x4EC5;&#x663E;&#x793A;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x4E4B;&#x524D;&#x7684;&#x63D0;&#x4EA4;&#x3002;</p>
<p>--author: &#x4EC5;&#x663E;&#x793A;&#x6307;&#x5B9A;&#x4F5C;&#x8005;&#x76F8;&#x5173;&#x7684;&#x63D0;&#x4EA4;&#x3002;</p>
<p>--committer&#x201D;&#x4EC5;&#x663E;&#x793A;&#x6307;&#x5B9A;&#x63D0;&#x4EA4;&#x8005;&#x76F8;&#x5173;&#x7684;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x56FE;&#x5F62;&#x5316;&#x5DE5;&#x5177;&#x67E5;&#x9605;&#x63D0;&#x4EA4;&#x5386;&#x53F2;&#xFF1A;gitk&#xFF0C;&#x5B83;&#x662F;&#x7528;Tcl/Tk&#x5199;&#x6210;&#x7684;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x76F8;&#x5F53;&#x4E8E;git log&#x547D;&#x4EE4;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x7248;&#x672C;&#xFF0C;&#x51E1;&#x662F;git log&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x9009;&#x9879;&#x4E5F;&#x90FD;&#x80FD;&#x7528;&#x5728;gitk&#x4E0A;&#x3002;&#x5728;&#x9879;&#x76EE;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E2D;&#x8F93;&#x5165;</p>
<p><code>$ gitk</code>
gitk&#x547D;&#x4EE4;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x542F;&#x52A8;gitk&#x56FE;&#x5F62;&#x5316;&#x5DE5;&#x5177;&#xFF0C;&#x5982;&#x679C;&#x63D0;&#x793A;&#x6CA1;&#x6709;&#x5B89;&#x88C5;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x5B89;&#x88C5;gitk:</p>
<p><code>$ sudo apt-get install gitk</code>
&#x64A4;&#x9500;&#x64CD;&#x4F5C;&#xFF1A;&#x6709;&#x4E9B;&#x64CD;&#x4F5C;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x64A4;&#x9500;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x52A1;&#x5FC5;&#x8C28;&#x614E;&#x5C0F;&#x5FC3;&#xFF0C;&#x4E00;&#x65E6;&#x5931;&#x8BEF;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x3002;</p>
<p>&#x4FEE;&#x6539;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#xFF1A;&#x60F3;&#x8981;&#x64A4;&#x9500;&#x521A;&#x624D;&#x7684;&#x63D0;&#x4EA4;&#x64CD;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;--amend&#x9009;&#x9879;&#x91CD;&#x65B0;&#x63D0;&#x4EA4;&#xFF1A;</p>
<p><code>$ git commit --amend</code>
&#x6B64;&#x547D;&#x4EE4;&#x5C06;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x6682;&#x5B58;&#x533A;&#x57DF;&#x5FEB;&#x7167;&#x63D0;&#x4EA4;&#x3002;&#x5982;&#x679C;&#x521A;&#x624D;&#x63D0;&#x4EA4;&#x5B8C;&#x6CA1;&#x6709;&#x4F5C;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#xFF0C;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x6B64;&#x547D;&#x4EE4;&#x7684;&#x8BDD;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x6709;&#x673A;&#x4F1A;&#x91CD;&#x65B0;&#x7F16;&#x8F91;&#x63D0;&#x4EA4;&#x8BF4;&#x660E;&#xFF0C;&#x800C;&#x6240;&#x63D0;&#x4EA4;&#x7684;&#x6587;&#x4EF6;&#x5FEB;&#x7167;&#x548C;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x6837;&#x3002;&#x542F;&#x52A8;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x540E;&#xFF0C;&#x4F1A;&#x770B;&#x5230;&#x4E0A;&#x6B21;&#x63D0;&#x4EA4;&#x65F6;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x7F16;&#x8F91;&#x5B83;&#x786E;&#x8BA4;&#x6CA1;&#x95EE;&#x9898;&#x540E;&#x4FDD;&#x5B58;&#x9000;&#x51FA;&#xFF0C;&#x5C31;&#x4F1A;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x63D0;&#x4EA4;&#x8BF4;&#x660E;&#x8986;&#x76D6;&#x521A;&#x624D;&#x5931;&#x8BEF;&#x7684;&#x63D0;&#x4EA4;&#x3002;&#x5982;&#x679C;&#x521A;&#x624D;&#x63D0;&#x4EA4;&#x65F6;&#x5FD8;&#x4E86;&#x6682;&#x5B58;&#x67D0;&#x4E9B;&#x4FEE;&#x6539;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x8865;&#x4E0A;&#x6682;&#x5B58;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FD0;&#x884C;--amend &#x63D0;&#x4EA4;&#xFF1A;</p>
<p><code>$ git commit -m &apos;initial commit&apos;</code> 
<code>$ git add forgotten_file</code>
<code>$ git commit --amend</code>
&#x4E09;&#x6761;&#x547D;&#x4EE4;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x63D0;&#x4EA4;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x63D0;&#x4EA4;&#x547D;&#x4EE4;&#x4FEE;&#x6B63;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x7684;&#x63D0;&#x4EA4;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x53D6;&#x6D88;&#x5DF2;&#x7ECF;&#x6682;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#xFF1A;</p>
<p><code>$ git reset HEAD test.txt</code>
&#x53D6;&#x6D88;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#xFF1A;</p>
<p><code>$ git checkout -- test.txt</code>
&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x6709;&#x4E9B;&#x5371;&#x9669;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x90FD;&#x6CA1;&#x6709;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x7528;&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x524D;&#xFF0C;&#x8BF7;&#x52A1;&#x5FC5;&#x786E;&#x5B9A;&#x771F;&#x7684;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x521A;&#x624D;&#x7684;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x4F7F;&#x7528;&#xFF1A;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x662F;&#x6307;&#x6258;&#x7BA1;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x9879;&#x76EE;&#x4ED3;&#x5E93;&#x3002;&#x7BA1;&#x7406;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5305;&#x62EC;&#x6DFB;&#x52A0;&#x8FDC;&#x7A0B;&#x5E93;&#xFF0C;&#x79FB;&#x9664;&#x5E9F;&#x5F03;&#x7684;&#x8FDC;&#x7A0B;&#x5E93;&#xFF0C;&#x7BA1;&#x7406;&#x5404;&#x5F0F;&#x8FDC;&#x7A0B;&#x5E93;&#x5206;&#x652F;&#xFF0C;&#x5B9A;&#x4E49;&#x662F;&#x5426;&#x8DDF;&#x8E2A;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#x7B49;&#x3002;</p>
<p>&#x67E5;&#x770B;&#x5F53;&#x524D;&#x7684;&#x8FDC;&#x7A0B;&#x5E93;&#xFF1A;&#x8981;&#x67E5;&#x770B;&#x5F53;&#x524D;&#x914D;&#x7F6E;&#x6709;&#x54EA;&#x4E9B;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;</p>
<p><code>$ git remote</code>
&#x5B83;&#x4F1A;&#x5217;&#x51FA;&#x6BCF;&#x4E2A;&#x8FDC;&#x7A0B;&#x5E93;&#x7684;&#x7B80;&#x77ED;&#x540D;&#x5B57;&#x3002;&#x5728;&#x514B;&#x9686;&#x5B8C;&#x67D0;&#x4E2A;&#x9879;&#x76EE;&#x540E;&#xFF0C;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;origin &#x7684;&#x8FDC;&#x7A0B;&#x5E93;&#xFF0C;Git &#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x6765;&#x6807;&#x8BC6;&#x4F60;&#x6240;&#x514B;&#x9686;&#x7684;&#x539F;&#x59CB;&#x4ED3;&#x5E93;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x52A0;&#x4E0A;&#x201D;-v&#x201D;&#x9009;&#x9879;&#xFF0C;&#x663E;&#x793A;&#x5BF9;&#x5E94;&#x7684;&#x514B;&#x9686;&#x5730;&#x5740;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#xFF1A;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x6765;&#x5F15;&#x7528;&#xFF0C;&#x8FD0;&#x884C;</p>
<p><code>$ git remote add [shortname] [url]</code>
&#x4ECE;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x6293;&#x53D6;&#x6570;&#x636E;&#xFF1A;</p>
<p><code>$ git fetch [remote-name]</code>
&#x6B64;&#x547D;&#x4EE4;&#x4F1A;&#x5230;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4E2D;&#x62C9;&#x53D6;&#x6240;&#x6709;&#x4F60;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x4E2D;&#x8FD8;&#x6CA1;&#x6709;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD0;&#x884C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5730;&#x8BBF;&#x95EE;&#x8BE5;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5206;&#x652F;&#xFF0C;&#x5C06;&#x5176;&#x4E2D;&#x67D0;&#x4E2A;&#x5206;&#x652F;&#x5408;&#x5E76;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x53D6;&#x51FA;&#x67D0;&#x4E2A;&#x5206;&#x652F;&#x3002;fetch &#x547D;&#x4EE4;&#x53EA;&#x662F;&#x5C06;&#x8FDC;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x62C9;&#x5230;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#xFF0C;&#x5E76;&#x4E0D;&#x81EA;&#x52A8;&#x5408;&#x5E76;&#x5230;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x5206;&#x652F;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x4F60;&#x786E;&#x5B9E;&#x51C6;&#x5907;&#x597D;&#x4E86;&#xFF0C;&#x624D;&#x80FD;&#x624B;&#x5DE5;&#x5408;&#x5E76;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E86;&#x67D0;&#x4E2A;&#x5206;&#x652F;&#x7528;&#x4E8E;&#x8DDF;&#x8E2A;&#x67D0;&#x4E2A;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;</p>
<p><code>$ git pull</code>
git pull &#x547D;&#x4EE4;&#x81EA;&#x52A8;&#x6293;&#x53D6;&#x6570;&#x636E;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FDC;&#x7AEF;&#x5206;&#x652F;&#x81EA;&#x52A8;&#x5408;&#x5E76;&#x5230;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x4E2D;&#x5F53;&#x524D;&#x5206;&#x652F;&#x3002;</p>
<p>&#x63A8;&#x9001;&#x6570;&#x636E;&#x5230;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#xFF1A;</p>
<p><code>$ git push [remote-name] [branch-name]</code>
&#x53EA;&#x6709;&#x5728;&#x6240;&#x514B;&#x9686;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6709;&#x5199;&#x6743;&#x9650;&#xFF0C;&#x6216;&#x8005;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#x5728;&#x63A8;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x624D;&#x4F1A;&#x5982;&#x671F;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;&#x5982;&#x679C;&#x5728;&#x4F60;&#x63A8;&#x6570;&#x636E;&#x524D;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#x63A8;&#x9001;&#x4E86;&#x82E5;&#x5E72;&#x66F4;&#x65B0;&#xFF0C;&#x90A3;&#x4F60;&#x7684;&#x63A8;&#x9001;&#x64CD;&#x4F5C;&#x5C31;&#x4F1A;&#x88AB;&#x9A73;&#x56DE;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x5148;&#x628A;&#x4ED6;&#x4EEC;&#x7684;&#x66F4;&#x65B0;&#x6293;&#x53D6;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x5E76;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x63A8;&#x9001;&#x3002;</p>
<p>&#x67E5;&#x770B;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4FE1;&#x606F;&#xFF1A;</p>
<p><code>$ git remote show [remote-name]</code>
&#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x5220;&#x9664;&#x548C;&#x91CD;&#x547D;&#x540D;&#xFF1A;&#x53EF;&#x4EE5;&#x7528;git remote rename&#x547D;&#x4EE4;&#x4FEE;&#x6539;&#x67D0;&#x4E2A;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x7B80;&#x77ED;&#x540D;&#x79F0;&#xFF0C;&#x6BD4;&#x5982;&#x60F3;&#x628A;pb&#x6539;&#x6210;paul&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x8FD0;&#x884C;:</p>
<p><code>$ git remote rename pb paul</code>
&#x5BF9;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x91CD;&#x547D;&#x540D;&#xFF0C;&#x4E5F;&#x4F1A;&#x4F7F;&#x5BF9;&#x5E94;&#x7684;&#x5206;&#x652F;&#x540D;&#x79F0;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x539F;&#x6765;&#x7684;pb/master &#x5206;&#x652F;&#x73B0;&#x5728;&#x6210;&#x4E86;paul/master&#x3002;&#x78B0;&#x5230;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x8FC1;&#x79FB;&#xFF0C;&#x6216;&#x8005;&#x539F;&#x6765;&#x7684;&#x514B;&#x9686;&#x955C;&#x50CF;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#x4E0D;&#x518D;&#x8D21;&#x732E;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x79FB;&#x9664;&#x5BF9;&#x5E94;&#x7684;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;git remote rm &#x547D;&#x4EE4;:</p>
<p><code>$ git remote rm paul</code>
&#x6253;&#x6807;&#x7B7E;&#xFF1A;&#x540C;&#x5927;&#x591A;&#x6570;VCS &#x4E00;&#x6837;&#xFF0C;Git &#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;&#x67D0;&#x4E00;&#x65F6;&#x95F4;&#x70B9;&#x4E0A;&#x7684;&#x7248;&#x672C;&#x6253;&#x4E0A;&#x6807;&#x7B7E;&#x3002;&#x4EBA;&#x4EEC;&#x5728;&#x53D1;&#x5E03;&#x67D0;&#x4E2A;&#x8F6F;&#x4EF6;&#x7248;&#x672C;&#xFF08;&#x6BD4;&#x5982;v1.0 &#x7B49;&#x7B49;&#xFF09;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5E38;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
<p>&#x5217;&#x51FA;&#x5DF2;&#x6709;&#x7684;&#x6807;&#x7B7E;&#xFF1A;</p>
<p>$ git tag
&#x663E;&#x793A;&#x7684;&#x6807;&#x7B7E;&#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF0C;&#x6240;&#x4EE5;&#x6807;&#x7B7E;&#x7684;&#x5148;&#x540E;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x7684;&#x8F7B;&#x91CD;&#x3002;&#x5982;&#x679C;&#x53EA;&#x5BF9;&#x67D0;&#x7CFB;&#x5217;&#x7684;&#x7248;&#x672C;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF1A;</p>
<p>$ git tag -l &apos;v1.4.2.*&apos;
&#x65B0;&#x5EFA;&#x6807;&#x7B7E;&#xFF1A;Git&#x4F7F;&#x7528;&#x7684;&#x6807;&#x7B7E;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#xFF08;lightweight&#xFF09;&#x548C;&#x542B;&#x9644;&#x6CE8;&#x7684;&#xFF08;annotated&#xFF09;&#x3002;&#x8F7B;&#x91CF;&#x7EA7;&#x6807;&#x7B7E;&#x5C31;&#x50CF;&#x662F;&#x4E2A;&#x4E0D;&#x4F1A;&#x53D8;&#x5316;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x5C31;&#x662F;&#x4E2A;&#x6307;&#x5411;&#x7279;&#x5B9A;&#x63D0;&#x4EA4;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x3002;&#x800C;&#x542B;&#x9644;&#x6CE8;&#x6807;&#x7B7E;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x6709;&#x81EA;&#x8EAB;&#x7684;&#x6821;&#x9A8C;&#x548C;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x542B;&#x7740;&#x6807;&#x7B7E;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x548C;&#x65E5;&#x671F;&#xFF0C;&#x4EE5;&#x53CA;&#x6807;&#x7B7E;&#x8BF4;&#x660E;&#xFF0C;&#x6807;&#x7B7E;&#x672C;&#x8EAB;&#x4E5F;&#x5141;&#x8BB8;&#x4F7F;&#x7528;GNU Privacy Guard (GPG) &#x6765;&#x7B7E;&#x7F72;&#x6216;&#x9A8C;&#x8BC1;&#x3002;&#x4E00;&#x822C;&#x90FD;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x542B;&#x9644;&#x6CE8;&#x578B;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4EE5;&#x4FBF;&#x4FDD;&#x7559;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002;
&#x542B;&#x9644;&#x6CE8;&#x7684;&#x6807;&#x7B7E;&#xFF1A;</p>
<p>$ git tag -a v1.0 -m &apos;my version 1.0&apos;
&#x800C;-m&#x9009;&#x9879;&#x5219;&#x6307;&#x5B9A;&#x4E86;&#x5BF9;&#x5E94;&#x7684;&#x6807;&#x7B7E;&#x8BF4;&#x660E;&#xFF0C;Git&#x4F1A;&#x5C06;&#x6B64;&#x8BF4;&#x660E;&#x4E00;&#x540C;&#x4FDD;&#x5B58;&#x5728;&#x6807;&#x7B7E;&#x5BF9;&#x8C61;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x5728;&#x6B64;&#x9009;&#x9879;&#x540E;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x5177;&#x4F53;&#x7684;&#x8BF4;&#x660E;&#x5185;&#x5BB9;&#xFF0C;Git&#x4F1A;&#x542F;&#x52A8;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x8F6F;&#x4EF6;&#x4F9B;&#x4F60;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;git show&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x76F8;&#x5E94;&#x6807;&#x7B7E;&#x7684;&#x7248;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x8FDE;&#x540C;&#x663E;&#x793A;&#x6253;&#x6807;&#x7B7E;&#x65F6;&#x7684;&#x63D0;&#x4EA4;&#x5BF9;&#x8C61;&#xFF1A;</p>
<p>$ git show v1.0
&#x7B7E;&#x7F72;&#x6807;&#x7B7E;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;GPG&#x6765;&#x7B7E;&#x7F72;&#x6807;&#x7B7E;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x628A;&#x4E4B;&#x524D;&#x7684;-a&#x6539;&#x4E3A;-s&#x5373;&#x53EF;&#x3002;</p>
<p>&#x8F7B;&#x91CF;&#x7EA7;&#x6807;&#x7B7E;&#xFF1A;&#x8F7B;&#x91CF;&#x7EA7;&#x6807;&#x7B7E;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x7740;&#x5BF9;&#x5E94;&#x63D0;&#x4EA4;&#x5BF9;&#x8C61;&#x7684;&#x6821;&#x9A8C;&#x548C;&#x4FE1;&#x606F;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x8981;&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4E00;&#x4E2A;-a&#xFF0C;-s &#x6216;-m &#x9009;&#x9879;&#x90FD;&#x4E0D;&#x7528;&#xFF0C;&#x76F4;&#x63A5;&#x7ED9;&#x51FA;&#x6807;&#x7B7E;&#x540D;&#x5B57;&#x5373;&#x53EF;</p>
<p>$ git tag v2.0
&#x9A8C;&#x8BC1;&#x6807;&#x7B7E;&#xFF1A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;</p>
<p>$ git tag -v [tag-name] 
&#x7684;&#x65B9;&#x5F0F;&#x9A8C;&#x8BC1;&#x5DF2;&#x7ECF;&#x7B7E;&#x7F72;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x6B64;&#x547D;&#x4EE4;&#x4F1A;&#x8C03;&#x7528;GPG&#x6765;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x9700;&#x8981;&#x6709;&#x7B7E;&#x7F72;&#x8005;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x5B58;&#x653E;&#x5728;keyring&#x4E2D;&#x624D;&#x80FD;&#x9A8C;&#x8BC1;&#x3002;</p>
<p>&#x540E;&#x671F;&#x52A0;&#x6CE8;&#x6807;&#x7B7E;&#xFF1A;&#x53EF;&#x4EE5;&#x5728;&#x540E;&#x671F;&#x5BF9;&#x65E9;&#x5148;&#x7684;&#x67D0;&#x6B21;&#x63D0;&#x4EA4;&#x52A0;&#x6CE8;&#x6807;&#x7B7E;&#x3002;&#x53EA;&#x8981;&#x5728;&#x6253;&#x6807;&#x7B7E;&#x7684;&#x65F6;&#x5019;&#x8DDF;&#x4E0A;&#x5BF9;&#x5E94;&#x63D0;&#x4EA4;&#x5BF9;&#x8C61;&#x7684;&#x6821;&#x9A8C;&#x548C;(&#x6216;&#x524D;&#x51E0;&#x4F4D;&#x5B57;&#x7B26;)&#x5373;&#x53EF;&#xFF1A;</p>
<p>$ git tag -a v1.3 d06e3de00
&#x5206;&#x4EAB;&#x6807;&#x7B7E;&#xFF1A;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;git push&#x5E76;&#x4E0D;&#x4F1A;&#x628A;&#x6807;&#x7B7E;&#x4F20;&#x9001;&#x5230;&#x8FDC;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x663E;&#x5F0F;&#x547D;&#x4EE4;&#x624D;&#x80FD;&#x5206;&#x4EAB;&#x6807;&#x7B7E;&#x5230;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#xFF0C;&#x8FD0;&#x884C;</p>
<p>$ git push origin [tagname]
&#x5373;&#x53EF;&#x3002;&#x5982;&#x679C;&#x8981;&#x4E00;&#x6B21;&#x63A8;&#x9001;&#x6240;&#x6709;(&#x672C;&#x5730;&#x65B0;&#x589E;&#x7684;)&#x6807;&#x7B7E;&#x4E0A;&#x53BB;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;--tags&#x9009;&#x9879;&#xFF1A;</p>
<p>$ git push origin --tags
Git&#x5206;&#x652F;</p>
<pre><code>     Git&#x4E2D;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x5176;&#x5B9E;&#x672C;&#x8D28;&#x4E0A;&#x4EC5;&#x4EC5;&#x662F;&#x4E2A;&#x6307;&#x5411;commit &#x5BF9;&#x8C61;&#x7684;&#x53EF;&#x53D8;&#x6307;&#x9488;&#x3002;Git&#x4F1A;&#x4F7F;&#x7528;master &#x4F5C;&#x4E3A;&#x5206;&#x652F;&#x7684;&#x9ED8;&#x8BA4;&#x540D;&#x5B57;&#x3002;&#x5728;&#x82E5;&#x5E72;&#x6B21;&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x4F60;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#x5BF9;&#x8C61;&#x7684;master &#x5206;&#x652F;&#xFF0C;&#x5B83;&#x5728;&#x6BCF;&#x6B21;&#x63D0;&#x4EA4;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x5411;&#x524D;&#x79FB;&#x52A8;&#x3002;

     &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x5373;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5206;&#x652F;&#x6307;&#x9488;&#x3002;&#x6BD4;&#x5982;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;testing&#x5206;&#x652F;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;git branch&#x547D;&#x4EE4;&#xFF1A;
</code></pre><p>$ git branch testing
HEAD&#x7279;&#x522B;&#x6307;&#x9488;&#xFF0C;&#x5728;Git&#x4E2D;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x4F60;&#x6B63;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x672C;&#x5730;&#x5206;&#x652F;&#x7684;&#x6307;&#x9488;&#x3002;&#x8FD0;&#x884C;git branch &#x547D;&#x4EE4;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x5207;&#x6362;&#x5230;&#x8FD9;&#x4E2A;&#x5206;&#x652F;&#x4E2D;&#x53BB;&#x3002;&#x8981;&#x5207;&#x6362;&#x5230;&#x5176;&#x5B83;&#x5206;&#x652F;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;git checkout&#x547D;&#x4EE4;&#xFF1A;</p>
<p>$ git checkout testing
&#x8FD9;&#x6837;HEAD&#x5C31;&#x6307;&#x5411;&#x4E86;testing&#x5206;&#x652F;&#x3002;&#x6BCF;&#x6B21;&#x63D0;&#x4EA4;&#x540E;HEAD&#x968F;&#x7740;&#x5206;&#x652F;&#x4E00;&#x8D77;&#x5411;&#x524D;&#x79FB;&#x52A8;&#x3002;</p>
<p>$ git checkout -b testing 
&#x76F8;&#x5F53;&#x4E8E;&#xFF1A;</p>
<p>$ git branch testing
$ git checkout testing
&#x4E24;&#x6761;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x7531;&#x4E8E;Git&#x4E2D;&#x7684;&#x5206;&#x652F;&#x5B9E;&#x9645;&#x4E0A;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6240;&#x6307;&#x5BF9;&#x8C61;&#x6821;&#x9A8C;&#x548C;&#xFF08;40&#x4E2A;&#x5B57;&#x7B26;&#x957F;&#x5EA6;SHA-1&#x5B57;&#x4E32;&#xFF09;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x5C31;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5EC9;&#x4EF7;&#x3002;&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x5C31;&#x662F;&#x5411;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5199;&#x5165;41 &#x4E2A;&#x5B57;&#x8282;&#xFF08;&#x5916;&#x52A0;&#x4E00;&#x4E2A;&#x6362;&#x884C;&#x7B26;&#xFF09;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x5C31;&#x5F88;&#x5FEB;&#x4E86;&#x3002;&#x8F6C;&#x6362;&#x5206;&#x652F;&#x7684;&#x65F6;&#x5019;&#x6700;&#x597D;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x6E05;&#x6D01;&#x7684;&#x5DE5;&#x4F5C;&#x533A;&#x57DF;&#x3002;Git&#x4F1A;&#x628A;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x7684;&#x5185;&#x5BB9;&#x6062;&#x590D;&#x4E3A;&#x68C0;&#x51FA;&#x67D0;&#x5206;&#x652F;&#x65F6;&#x5B83;&#x6240;&#x6307;&#x5411;&#x7684;&#x90A3;&#x4E2A;commit &#x7684;&#x5FEB;&#x7167;&#x3002;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x6DFB;&#x52A0;&#x3001;&#x5220;&#x9664;&#x548C;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x4EE5;&#x786E;&#x4FDD;&#x76EE;&#x5F55;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x4F60;&#x4E0A;&#x6B21;&#x63D0;&#x4EA4;&#x65F6;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5206;&#x652F;&#x5408;&#x5E76;&#xFF1A;&#x7528;git merge&#x547D;&#x4EE4;&#x6765;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;</p>
<p>$ git merge testing
 &#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#xFF1A;</p>
<p>$ git branch -d testing
&#x51B2;&#x7A81;&#x7684;&#x5408;&#x5E76;&#xFF1A;&#x8981;&#x770B;&#x770B;&#x54EA;&#x4E9B;&#x6587;&#x4EF6;&#x5728;&#x5408;&#x5E76;&#x65F6;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;</p>
<p>$ git status
&#x67E5;&#x9605;&#x3002;&#x4EFB;&#x4F55;&#x5305;&#x542B;&#x672A;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x7684;&#x6587;&#x4EF6;&#x90FD;&#x4F1A;&#x4EE5;&#x672A;&#x5408;&#x5E76;&#xFF08;unmerged&#xFF09;&#x72B6;&#x6001;&#x5217;&#x51FA;&#x3002;Git&#x4F1A;&#x5728;&#x6709;&#x51B2;&#x7A81;&#x7684;&#x6587;&#x4EF6;&#x91CC;&#x52A0;&#x5165;&#x6807;&#x51C6;&#x7684;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x6807;&#x8BB0;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B83;&#x4EEC;&#x6765;&#x624B;&#x5DE5;&#x5B9A;&#x4F4D;&#x5E76;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x51B2;&#x7A81;&#x3002;&#x5728;&#x89E3;&#x51B3;&#x4E86;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x91CC;&#x7684;&#x6240;&#x6709;&#x51B2;&#x7A81;&#x540E;&#xFF0C;&#x8FD0;&#x884C;</p>
<p>$ git add
&#x5C06;&#x628A;&#x5B83;&#x4EEC;&#x6807;&#x8BB0;&#x4E3A;&#x5DF2;&#x89E3;&#x51B3;&#xFF08;resolved&#xFF09;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x6682;&#x5B58;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x51B2;&#x7A81;&#x5DF2;&#x7ECF;&#x89E3;&#x51B3;&#x3002;&#x6700;&#x540E;&#x518D;&#x7528;</p>
<p>$ git commit
&#x6765;&#x5B8C;&#x6210;&#x8FD9;&#x6B21;&#x5408;&#x5E76;&#x63D0;&#x4EA4;&#x3002;</p>
<pre><code>     &#x5982;&#x679C;&#x60F3;&#x7528;&#x4E00;&#x4E2A;&#x6709;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;
</code></pre><p>$ git mergetool
&#x5B83;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x5408;&#x5E76;&#x5DE5;&#x5177;&#x5E76;&#x5F15;&#x5BFC;&#x4F60;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x5206;&#x652F;&#x7BA1;&#x7406;&#xFF1A;git branch&#x547D;&#x4EE4;&#x4E0D;&#x4EC5;&#x4EC5;&#x80FD;&#x521B;&#x5EFA;&#x548C;&#x5220;&#x9664;&#x5206;&#x652F;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x52A0;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x4F1A;&#x7ED9;&#x51FA;&#x5F53;&#x524D;&#x6240;&#x6709;&#x5206;&#x652F;&#x7684;&#x6E05;&#x5355;&#x3002;&#x82E5;&#x8981;&#x67E5;&#x770B;&#x5404;&#x4E2A;&#x5206;&#x652F;&#x6700;&#x540E;&#x4E00;&#x6B21;commit&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FD0;&#x884C;, </p>
<p>$ git branch -v
&#x8981;&#x4ECE;&#x8BE5;&#x6E05;&#x5355;&#x4E2D;&#x7B5B;&#x9009;&#x51FA;&#x4F60;&#x5DF2;&#x7ECF;&#xFF08;&#x6216;&#x5C1A;&#x672A;&#xFF09;&#x4E0E;&#x5F53;&#x524D;&#x5206;&#x652F;&#x5408;&#x5E76;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;--merge &#x548C;--no-merged&#x9009;&#x9879;&#x3002;&#x6BD4;&#x5982;&#xFF0C;</p>
<p>$ git branch --merge
&#x67E5;&#x770B;&#x54EA;&#x4E9B;&#x5206;&#x652F;&#x5DF2;&#x88AB;&#x5E76;&#x5165;&#x5F53;&#x524D;&#x5206;&#x652F;&#x3002;&#x6E05;&#x5355;&#x4E2D;&#x5E26;&#x6709;&#x201D;<em>&#x201D;&#x5B57;&#x7B26;&#x7684;&#x8868;&#x793A;&#x5F53;&#x524D;&#x6240;&#x5728;&#x7684;&#x5206;&#x652F;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5217;&#x8868;&#x4E2D;&#x6CA1;&#x6709;&#x201D;</em>&#x201D;&#x7684;&#x5206;&#x652F;&#x901A;&#x5E38;&#x90FD;&#x53EF;&#x4EE5;&#x7528;git branch -d&#x6765;&#x5220;&#x6389;&#x3002;&#x5BF9;&#x4E8E;&#x672A;&#x5408;&#x5E76;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x7528;git branch -d&#x5220;&#x9664;&#x8BE5;&#x5206;&#x652F;&#x4F1A;&#x5BFC;&#x81F4;&#x5931;&#x8D25;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x575A;&#x4FE1;&#x4F60;&#x8981;&#x5220;&#x9664;&#x5B83;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5927;&#x5199;&#x7684;&#x5220;&#x9664;&#x9009;&#x9879;-D &#x5F3A;&#x5236;&#x6267;&#x884C;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;</p>
<p>$ git branch -D testing
&#x5206;&#x652F;&#x5F0F;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF1A;&#x957F;&#x671F;&#x5206;&#x652F;&#x3001;&#x7279;&#x6027;&#x5206;&#x652F;</p>
<pre><code>     &#x7279;&#x6027;&#x5206;&#x652F;&#xFF1A;&#x5728;&#x4EFB;&#x4F55;&#x89C4;&#x6A21;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7279;&#x6027;&#xFF08;Topic&#xFF09;&#x5206;&#x652F;&#x3002;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x5206;&#x652F;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x77ED;&#x671F;&#x7684;&#xFF0C;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x5355;&#x4E00;&#x7279;&#x6027;&#x6216;&#x4E0E;&#x5176;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#x7684;&#x5206;&#x652F;&#x3002;

     &#x8BF7;&#x52A1;&#x5FC5;&#x7262;&#x8BB0;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#x5168;&#x90E8;&#x90FD;&#x662F;&#x672C;&#x5730;&#x5206;&#x652F;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5F53;&#x4F60;&#x5728;&#x4F7F;&#x7528;&#x5206;&#x652F;&#x53CA;&#x5408;&#x5E76;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;Git&#x4ED3;&#x5E93;&#x4E2D;&#x8FDB;&#x884C;----&#x5B8C;&#x5168;&#x4E0D;&#x6D89;&#x53CA;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4EA4;&#x4E92;&#x3002;

     &#x8FDC;&#x7A0B;&#x5206;&#x652F;(remote branch)&#xFF1A;&#x662F;&#x5BF9;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x72B6;&#x6001;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x5B83;&#x4EEC;&#x662F;&#x4E00;&#x4E9B;&#x65E0;&#x6CD5;&#x79FB;&#x52A8;&#x7684;&#x672C;&#x5730;&#x5206;&#x652F;&#xFF1B;&#x53EA;&#x6709;&#x5728;&#x8FDB;&#x884C;Git&#x7684;&#x7F51;&#x7EDC;&#x6D3B;&#x52A8;&#x65F6;&#x624D;&#x4F1A;&#x66F4;&#x65B0;&#x3002;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x5C31;&#x50CF;&#x662F;&#x4E66;&#x7B7E;&#xFF0C;&#x63D0;&#x9192;&#x7740;&#x4F60;&#x4E0A;&#x6B21;&#x8FDE;&#x63A5;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x65F6;&#x4E0A;&#x9762;&#x5404;&#x5206;&#x652F;&#x7684;&#x4F4D;&#x7F6E;&#x3002;

     &#x63A8;&#x9001;&#xFF1A;&#x8981;&#x60F3;&#x548C;&#x5176;&#x4ED6;&#x4EBA;&#x5206;&#x4EAB;&#x67D0;&#x4E2A;&#x5206;&#x652F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x628A;&#x5B83;&#x63A8;&#x9001;&#x5230;&#x4E00;&#x4E2A;&#x4F60;&#x62E5;&#x6709;&#x5199;&#x6743;&#x9650;&#x7684;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x3002;&#x4F60;&#x7684;&#x672C;&#x5730;&#x5206;&#x652F;&#x4E0D;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x540C;&#x6B65;&#x5230;&#x4F60;&#x5F15;&#x5165;&#x7684;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x4E2D;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x660E;&#x786E;&#x6267;&#x884C;&#x63A8;&#x9001;&#x64CD;&#x4F5C;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x65E0;&#x610F;&#x5206;&#x4EAB;&#x7684;&#xFF0C;&#x4F60;&#x5C3D;&#x53EF;&#x4EE5;&#x4FDD;&#x7559;&#x4E3A;&#x79C1;&#x4EBA;&#x5206;&#x652F;&#xFF0C;&#x800C;&#x53EA;&#x63A8;&#x9001;&#x90A3;&#x4E9B;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x7684;&#x7279;&#x6027;&#x5206;&#x652F;&#x3002;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;
</code></pre><p>$ git push (&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x540D;) (&#x5206;&#x652F;&#x540D;)
&#x8DDF;&#x8E2A;&#x5206;&#x652F;&#xFF1A;&#x4ECE;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x68C0;&#x51FA;&#x7684;&#x672C;&#x5730;&#x5206;&#x652F;&#xFF0C;&#x79F0;&#x4E3A;&#x8DDF;&#x8E2A;&#x5206;&#x652F;(tracking branch)&#x3002;&#x8DDF;&#x8E2A;&#x5206;&#x652F;&#x662F;&#x4E00;&#x79CD;&#x548C;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x6709;&#x76F4;&#x63A5;&#x8054;&#x7CFB;&#x7684;&#x672C;&#x5730;&#x5206;&#x652F;&#x3002;&#x5728;&#x8DDF;&#x8E2A;&#x5206;&#x652F;&#x91CC;&#x8F93;&#x5165;</p>
<p>$ git push
Git&#x4F1A;&#x81EA;&#x884C;&#x63A8;&#x65AD;&#x5E94;&#x8BE5;&#x5411;&#x54EA;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x54EA;&#x4E2A;&#x5206;&#x652F;&#x63A8;&#x9001;&#x6570;&#x636E;&#x3002;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#x91CC;&#x8FD0;&#x884C;</p>
<p>$ git pull
&#x4F1A;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x8FDC;&#x7A0B;&#x7D22;&#x5F15;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x90FD;&#x5408;&#x5E76;&#x5230;&#x672C;&#x5730;&#x5206;&#x652F;&#x4E2D;&#x6765;&#x3002;</p>
<pre><code>     &#x5728;&#x514B;&#x9686;&#x4ED3;&#x5E93;&#x65F6;&#xFF0C;Git&#x901A;&#x5E38;&#x4F1A;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;master&#x5206;&#x652F;&#x6765;&#x8DDF;&#x8E2A;origin/master&#x3002;&#x8FD9;&#x6B63;&#x662F;git push&#x548C;git pull&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x968F;&#x5FC3;&#x6240;&#x6B32;&#x5730;&#x8BBE;&#x5B9A;&#x4E3A;&#x5176;&#x5B83;&#x8DDF;&#x8E2A;&#x5206;&#x652F;&#xFF0C;&#x6BD4;&#x5982;origin &#x4E0A;&#x9664;&#x4E86;master &#x4E4B;&#x5916;&#x7684;&#x5176;&#x5B83;&#x5206;&#x652F;&#xFF0C;
</code></pre><p>$ git checkout -b [&#x5206;&#x652F;&#x540D;] [&#x8FDC;&#x7A0B;&#x540D;]/[&#x5206;&#x652F;&#x540D;]
&#x5220;&#x9664;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#xFF1A;&#x5982;&#x679C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x67D0;&#x4E2A;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x641E;&#x5B9A;&#x4E86;&#x67D0;&#x4E2A;&#x7279;&#x6027;&#x5E76;&#x628A;&#x5B83;&#x5408;&#x5E76;&#x8FDB;&#x4E86;&#x8FDC;&#x7A0B;&#x7684;master &#x5206;&#x652F;&#xFF08;&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5B58;&#x653E;&#x7A33;&#x5B9A;&#x4EE3;&#x7801;&#x7684;&#x5730;&#x65B9;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x65E0;&#x5398;&#x5934;&#x7684;&#x8BED;&#x6CD5;&#x6765;&#x5220;&#x9664;&#x5B83;&#xFF1A;</p>
<p>$ git push [&#x8FDC;&#x7A0B;&#x540D;]:[&#x5206;&#x652F;&#x540D;]
&#x884D;&#x5408;&#xFF1A;&#x628A;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x6574;&#x5408;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x7684;&#x529E;&#x6CD5;&#x6709;&#x4E24;&#x79CD;&#xFF1A;merge&#xFF08;&#x5408;&#x5E76;&#xFF09;&#x548C;rebase&#xFF08;&#x884D;&#x5408;&#xFF09;&#x3002;</p>
<pre><code>     &#x6709;&#x4E86;rebase&#x547D;&#x4EE4;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5728;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x91CC;&#x63D0;&#x4EA4;&#x7684;&#x6539;&#x53D8;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x91CC;&#x91CD;&#x653E;&#x4E00;&#x904D;&#x3002;&#x5982;&#xFF0C;
</code></pre><p>$ git checkout testing
$ git rebase master
&#x5B83;&#x7684;&#x539F;&#x7406;&#x662F;&#x56DE;&#x5230;&#x4E24;&#x4E2A;&#x5206;&#x652F;&#xFF08;&#x4F60;&#x6240;&#x5728;&#x7684;&#x5206;&#x652F;&#x548C;&#x4F60;&#x60F3;&#x8981;&#x884D;&#x5408;&#x8FDB;&#x53BB;&#x7684;&#x5206;&#x652F;&#xFF09;&#x7684;&#x5171;&#x540C;&#x7956;&#x5148;&#xFF0C;&#x63D0;&#x53D6;&#x4F60;&#x6240;&#x5728;&#x5206;&#x652F;&#x6BCF;&#x6B21;&#x63D0;&#x4EA4;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x5DEE;&#x5F02;&#xFF08;diff&#xFF09;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#x5206;&#x522B;&#x4FDD;&#x5B58;&#x5230;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x5F53;&#x524D;&#x5206;&#x652F;&#x8F6C;&#x6362;&#x5230;&#x4F60;&#x9700;&#x8981;&#x884D;&#x5408;&#x5165;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x4F9D;&#x5E8F;&#x4F7F;&#x7528;&#x6BCF;&#x4E00;&#x4E2A;&#x5DEE;&#x5F02;&#x8865;&#x4E01;&#x6587;&#x4EF6;&#x3002;&#x884D;&#x5408;&#x80FD;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x6574;&#x6D01;&#x7684;&#x63D0;&#x4EA4;&#x5386;&#x53F2;&#x3002;&#x5982;&#x679C;&#x89C6;&#x5BDF;&#x4E00;&#x4E2A;&#x884D;&#x5408;&#x8FC7;&#x7684;&#x5206;&#x652F;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x6E05;&#x695A;&#xFF0C;&#x4EFF;&#x4F5B;&#x6240;&#x6709;&#x4FEE;&#x6539;&#x90FD;&#x662F;&#x5148;&#x540E;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x4EEC;&#x539F;&#x6765;&#x662F;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x3002;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x56DE;&#x5230;master&#x5206;&#x652F;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5FEB;&#x8FDB;&#x5408;&#x5E76;&#xFF1A;</p>
<p>$ git checkout master
$ git merge testing
$ git rebase master testing 
&#x547D;&#x4EE4;&#x4F1A;&#x5148;&#x68C0;&#x51FA;&#x7279;&#x6027;&#x5206;&#x652F;testing&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4E3B;&#x5206;&#x652F;master&#x4E0A;&#x91CD;&#x6F14;&#xFF0C;&#x7136;&#x540E;&#x5FEB;&#x8FDB;&#x4E3B;&#x5206;&#x652F;master&#xFF0C;</p>
<p>$ git checkout master
$ git merge testing
 &#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x884D;&#x5408;&#x90A3;&#x4E9B;&#x5DF2;&#x7ECF;&#x63A8;&#x9001;&#x5230;&#x516C;&#x5171;&#x4ED3;&#x5E93;&#x7684;&#x66F4;&#x65B0;&#x3002;&#x5728;&#x884D;&#x5408;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x629B;&#x5F03;&#x4E86;&#x4E00;&#x4E9B;&#x73B0;&#x5B58;&#x7684;commit &#x800C;&#x521B;&#x9020;&#x4E86;&#x4E00;&#x4E9B;&#x7C7B;&#x4F3C;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x65B0;commit&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;commit &#x63A8;&#x9001;&#x5230;&#x67D0;&#x5904;&#x7136;&#x540E;&#x5176;&#x4ED6;&#x4EBA;&#x4E0B;&#x8F7D;&#x5E76;&#x5728;&#x5176;&#x57FA;&#x7840;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x7528;git rebase &#x91CD;&#x5199;&#x4E86;&#x8FD9;&#x4E9B;commit &#x518D;&#x63A8;&#x9001;&#x4E00;&#x6B21;&#xFF0C;&#x4F60;&#x7684;&#x5408;&#x4F5C;&#x8005;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x5408;&#x5E76;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x4F60;&#x518D;&#x6B21;&#x4ECE;&#x4ED6;&#x4EEC;&#x90A3;&#x91CC;&#x83B7;&#x53D6;&#x5185;&#x5BB9;&#x7684;&#x65F6;&#x5019;&#x4E8B;&#x60C5;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x4E00;&#x56E2;&#x7CDF;&#x3002;&#x5982;&#x679C;&#x628A;&#x884D;&#x5408;&#x5F53;&#x6210;&#x4E00;&#x79CD;&#x5728;&#x63A8;&#x9001;&#x4E4B;&#x524D;&#x6E05;&#x7406;&#x63D0;&#x4EA4;&#x5386;&#x53F2;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x800C;&#x4E14;&#x4EC5;&#x4EC5;&#x884D;&#x5408;&#x90A3;&#x4E9B;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x516C;&#x5F00;&#x7684;commit&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x884D;&#x5408;&#x90A3;&#x4E9B;&#x5DF2;&#x7ECF;&#x516C;&#x5F00;&#x7684;commit&#xFF0C;&#x800C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x5176;&#x4ED6;&#x4EBA;&#x5DF2;&#x7ECF;&#x7528;&#x8FD9;&#x4E9B;commit &#x8FDB;&#x884C;&#x4E86;&#x540E;&#x7EED;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x5C31;&#x9EBB;&#x70E6;&#x4E86;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;Git</p>
<pre><code>     &#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5927;&#x5BB6;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x5171;&#x4EAB;&#x4ED3;&#x5E93;&#xFF0C;&#x4ECE;&#x90A3;&#x91CC;&#x63A8;&#x9001;&#x548C;&#x62C9;&#x53D6;&#x6570;&#x636E;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x628A;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x79F0;&#x4E3A;&#x201C;Git &#x670D;&#x52A1;&#x5668;&#x201D;&#x3002;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x901A;&#x5E38;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7EAF;&#x4ED3;&#x5E93;(bare repository)----&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x7684;&#x4ED3;&#x5E93;&#x3002;&#x56E0;&#x4E3A;&#x8BE5;&#x4ED3;&#x5E93;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x4F5C;&#x5A92;&#x4ECB;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x9700;&#x8981;&#x4ECE;&#x4E00;&#x4E2A;&#x5904;&#x4E8E;&#x5DF2;&#x4ECE;&#x786C;&#x76D8;&#x4E0A;&#x68C0;&#x51FA;&#x72B6;&#x6001;&#x7684;&#x5FEB;&#x7167;&#xFF1B;&#x4ED3;&#x5E93;&#x91CC;&#x4EC5;&#x4EC5;&#x662F;Git &#x7684;&#x6570;&#x636E;&#x3002;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#xFF0C;&#x7EAF;&#x4ED3;&#x5E93;&#x662F;&#x4F60;&#x9879;&#x76EE;&#x91CC;.git &#x76EE;&#x5F55;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x522B;&#x65E0;&#x4ED6;&#x7269;&#x3002;

     &#x534F;&#x8BAE;&#xFF1A;Git&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x56DB;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x534F;&#x8BAE;&#x6765;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF1A;&#x672C;&#x5730;&#x4F20;&#x8F93;&#xFF0C;SSH&#x534F;&#x8BAE;&#xFF0C;Git&#x534F;&#x8BAE;&#x548C;HTTP &#x534F;&#x8BAE;&#x3002;

     &#x5728;&#x670D;&#x52A1;&#x5668;&#x90E8;&#x7F72;Git&#xFF1A;&#x5F00;&#x59CB;&#x67B6;&#x8BBE;Git &#x670D;&#x52A1;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x4E00;&#x4E2A;&#x73B0;&#x5B58;&#x7684;&#x4ED3;&#x5E93;&#x5BFC;&#x51FA;&#x4E3A;&#x65B0;&#x7684;&#x7EAF;&#x4ED3;&#x5E93;----&#x4E0D;&#x5305;&#x542B;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x7684;&#x4ED3;&#x5E93;&#x3002;&#x65B9;&#x6CD5;&#x975E;&#x5E38;&#x76F4;&#x622A;&#x4E86;&#x5F53;&#x3002;&#x628A;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x514B;&#x9686;&#x4E3A;&#x7EAF;&#x4ED3;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;clone &#x547D;&#x4EE4;&#x7684;--bare &#x9009;&#x9879;&#x3002;&#x7EAF;&#x4ED3;&#x5E93;&#x7684;&#x76EE;&#x5F55;&#x540D;&#x4EE5;.git &#x7ED3;&#x5C3E;&#xFF0C;&#x5982; 
</code></pre><p>$ git clone -bare my_project my_project.git
&#x73B0;&#x5728;&#x5728;my_project.git&#x4E2D;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4EFD;Git&#x76EE;&#x5F55;&#x6570;&#x636E;&#x7684;&#x526F;&#x672C;&#x3002;</p>
<pre><code>     &#x6709;&#x4E86;&#x4ED3;&#x5E93;&#x7684;&#x7EAF;&#x526F;&#x672C;&#x4EE5;&#x540E;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x628A;&#x5B83;&#x653E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5E76;&#x8BBE;&#x5B9A;&#x76F8;&#x5173;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x57DF;&#x540D;&#x4E3A;git.example.com&#x7684;&#x670D;&#x52A1;&#x5668;&#x5DF2;&#x7ECF;&#x67B6;&#x8BBE;&#x597D;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;SSH &#x8BBF;&#x95EE;&#xFF0C;&#x800C;&#x4F60;&#x60F3;&#x628A;&#x6240;&#x6709;&#x7684;Git&#x4ED3;&#x5E93;&#x50A8;&#x5B58;&#x5728;/opt/git &#x76EE;&#x5F55;&#x4E0B;&#x3002;&#x53EA;&#x8981;&#x628A;&#x7EAF;&#x4ED3;&#x5E93;&#x590D;&#x5236;&#x4E0A;&#x53BB;&#xFF1A;
</code></pre><p>$ scp -r my_project.git user@git.example.com:/opt/git 
&#x73B0;&#x5728;&#xFF0C;&#x5176;&#x4ED6;&#x5BF9;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x5177;&#x6709;SSH&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x5E76;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;/opt/git&#x7684;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7528;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#x514B;&#x9686;&#xFF1A;</p>
<p>$ git clone user@git.example.com:/opt/git/my_project.git
&#x5047;&#x5982;&#x4E00;&#x4E2A;SSH &#x7528;&#x6237;&#x5BF9;/opt/git/my_project.git &#x76EE;&#x5F55;&#x6709;&#x5199;&#x6743;&#x9650;&#xFF0C;&#x4ED6;&#x4F1A;&#x81EA;&#x52A8;&#x5177;&#x6709;&#x63A8;&#x9001;&#x6743;&#x9650;&#x3002;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x8FD0;&#x884C;git init &#x547D;&#x4EE4;&#x7684;&#x65F6;&#x5019;&#x52A0;&#x4E0A;--shared &#x9009;&#x9879;&#xFF0C;Git &#x4F1A;&#x81EA;&#x52A8;&#x5BF9;&#x8BE5;&#x4ED3;&#x5E93;&#x52A0;&#x5165;&#x53EF;&#x5199;&#x7684;&#x7EC4;: </p>
<p>$ ssh user@git.example.com
$ cd /opt/git/my_project.git
$ git init --bare --shared 
&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E0A;&#x5BC6;&#x5207;&#x5408;&#x4F5C;&#x4E86;&#x3002;</p>
<pre><code>     Git&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF1A;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x7684;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x6570;&#x91CF;&#x7E41;&#x591A;&#xFF0C;&#x5982;GitHub&#x3002;
</code></pre><p>&#x5206;&#x5E03;&#x5F0F;Git</p>
<pre><code>     &#x5206;&#x5E03;&#x5F0F;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF1A;&#x540C;&#x4F20;&#x7EDF;&#x7684;&#x96C6;&#x4E2D;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;CVCS&#xFF09;&#x4E0D;&#x540C;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x65B9;&#x5F0F;&#x56E0;Git &#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7279;&#x6027;&#x800C;&#x53D8;&#x5F97;&#x66F4;&#x4E3A;&#x7075;&#x6D3B;&#x591A;&#x6837;&#x3002;&#x5728;&#x96C6;&#x4E2D;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x5C31;&#x50CF;&#x662F;&#x8FDE;&#x63A5;&#x5728;&#x96C6;&#x7EBF;&#x5668;&#x4E0A;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5F7C;&#x6B64;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x5927;&#x4F53;&#x76F8;&#x50CF;&#x3002;&#x800C;&#x5728;Git &#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x540C;&#x65F6;&#x626E;&#x6F14;&#x7740;&#x8282;&#x70B9;&#x548C;&#x96C6;&#x7EBF;&#x5668;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x8D21;&#x732E;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x4ED3;&#x5E93;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x5171;&#x4ED3;&#x5E93;&#xFF0C;&#x8BA9;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x8005;&#x57FA;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5F00;&#x59CB;&#xFF0C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4ED3;&#x5E93;&#x8D21;&#x732E;&#x4EE3;&#x7801;&#x3002;&#x4E8E;&#x662F;&#xFF0C;Git &#x7684;&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x4F5C;&#x4FBF;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x51FA;&#x79CD;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3002;
</code></pre><p>&#x4EE5;&#x4E0A;&#x5185;&#x5BB9;&#x6458;&#x81EA;&#x4E8E;&#x300A;Pro Git&#x300B;</p>
<p>&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#x5E38;&#x7528;&#x547D;&#x4EE4;&#x6C47;&#x603B;&#xFF1A;</p>
<ol>
<li><p>&#x67E5;&#x770B;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#xFF1A;$ git branch -a</p>
</li>
<li><p>&#x67E5;&#x770B;&#x672C;&#x5730;&#x5206;&#x652F;&#xFF1A;$ git branch</p>
</li>
<li><p>&#x5207;&#x6362;&#x5206;&#x652F;&#xFF1A;$ git checkout &#x5206;&#x652F;&#x540D;</p>
</li>
<li><p>&#x66F4;&#x65B0;&#x5230;&#x6307;&#x5B9A;&#x7248;&#x672C;&#xFF1A;$ git reset --hard 39c9064fe34a1331e3624fbbef33a3f66df8f6ba </p>
</li>
<li><p>&#x66F4;&#x65B0;&#x5230;&#x4E0A;&#x4E2A;&#x7248;&#x672C;&#xFF1A;$ git reset --hard HEAD^</p>
</li>
<li><p>&#x5C06;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x5730;&#xFF1A;$ git checkout -b  branch1 origin/branch1</p>
</li>
<li><p>&#x521B;&#x5EFA;&#x65B0;&#x5206;&#x652F;&#xFF0C;&#x5E76;&#x7ACB;&#x5373;&#x5207;&#x6362;&#x5230;&#x6B64;&#x65B0;&#x5206;&#x652F;&#xFF1A;$ git checkout -b branchname</p>
</li>
<li><p>&#x4ECE;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x4E0B;&#x8F7D;&#x6307;&#x5B9A;&#x7684;&#x5206;&#x652F;&#xFF1A;$ git pull origin branchname</p>
</li>
<li><p>&#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x4F5C;&#x4E86;&#x54EA;&#x4E9B;&#x4FEE;&#x6539;&#xFF1A;$ git diff src/a.cpp</p>
</li>
<li><p>&#x5728;&#x5408;&#x5E76;&#x8FDB;&#x4ED3;&#x5E93;&#x4E4B;&#x524D;&#xFF0C;&#x4FEE;&#x6539;&#x4E0A;&#x6B21;&#x7684;&#x63D0;&#x4EA4;&#xFF1A;$ git commit --amend</p>
</li>
<li><p>&#x64A4;&#x9500;&#x4E3A;&#x63D0;&#x4EA4;&#x7684;&#x4FEE;&#x6539;&#xFF1A;$ git checkout -- a.cpp</p>
</li>
<li><p>&#x64A4;&#x9500;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;(&#x614E;&#x7528;)&#xFF1A;$ git checkout .</p>
</li>
<li><p>&#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x8BE6;&#x7EC6;&#x7684;&#x4FEE;&#x6539;&#x4FE1;&#x606F;&#xFF1A;$ git blame src/a.cpp</p>
</li>
<li><p>&#x5220;&#x9664;&#x672C;&#x5730;&#x6240;&#x6709;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x65B0;&#x589E;&#x7684;&#x6587;&#x4EF6;(&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5DF2;&#x7ECF;&#x88AB;staged&#x4E0D;&#x4F1A;&#x88AB;&#x56DE;&#x9000;)&#xFF1A;$ git clean -df</p>
</li>
<li><p>&#x64A4;&#x9500;&#x672C;&#x5730;&#x6240;&#x6709;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x66F4;&#x6539;(&#x5305;&#x62EC;&#x5DF2;&#x7ECF;&#x88AB;staged&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x4E0D;&#x5305;&#x62EC;&#x65B0;&#x589E;&#x7684;&#x6587;&#x4EF6;)&#xFF1A;$ git reset --hard</p>
</li>
<li><p>&#x4FEE;&#x6539;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5982;&#x5C06;a.cpp&#x91CD;&#x547D;&#x540D;&#x4E3A;b.cpp&#xFF1A;$ git mv a.cpp b.cpp</p>
</li>
<li><p>&#x5220;&#x9664;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;src/a.cpp&#xFF1A;$ git rm src/a.cpp</p>
</li>
<li><p>&#x5220;&#x9664;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x76EE;&#x5F55;src/aa&#xFF1A;$ git rm src/aa -r -f</p>
</li>
<li><p>&#x5047;&#x5982;&#x4E4B;&#x524D;&#x57FA;&#x4E8E;master&#x65B0;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x652F;dev&#xFF0C;&#x4F46;&#x662F;&#x540E;&#x6765;master&#x6709;&#x4E86;&#x591A;&#x4E8E;&#x4E00;&#x6B21;&#x7684;&#x63D0;&#x4EA4;&#xFF0C;&#x4F46;&#x662F;dev&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x6539;&#x52A8;&#xFF0C;&#x5047;&#x5982;&#x73B0;&#x5728;&#x60F3;&#x628A;master&#x7684;&#x63D0;&#x4EA4;&#x66F4;&#x65B0;&#x5230;dev&#x5206;&#x652F;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;dev&#x5206;&#x652F;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x6539;&#x52A8;&#x8FC7;&#xFF0C;&#x5047;&#x5982;master&#x63D0;&#x4EA4;&#x4E86;&#x4E24;&#x6B21;&#xFF0C;&#x9664;&#x4E86;&#x624B;&#x52A8;&#x8C03;&#x6574;&#x6539;&#x52A8;&#x7684;&#x6587;&#x4EF6;&#x5916;&#x8FD8;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x64CD;&#x4F5C;&#xFF0C;&#x5F53;&#x524D;&#x5728;dev&#x5206;&#x652F;&#xFF1A;$ git merge master  , $ git reset HEAD^^&#xFF0C;&#x56E0;&#x4E3A;master&#x591A;&#x4E8E;&#x4E00;&#x6B21;&#x7684;&#x63D0;&#x4EA4;&#xFF0C;&#x76F4;&#x63A5;git merge master,&#x5728;git push&#x662F;&#x4E0D;&#x884C;&#x7684; </p>
</li>
<li><p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x63D0;&#x4EA4;&#x8BB0;&#x5F55;&#x592A;&#x591A;&#xFF0C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;git log&#x5E76;&#x4E0D;&#x592A;&#x65B9;&#x4FBF;&#x67E5;&#x770B;&#x63D0;&#x4EA4;&#x5386;&#x53F2;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x901A;&#x8FC7;tree&#x7684;&#x65B9;&#x5F0F;&#x8F93;&#x51FA;&#xFF0C;&#x6267;&#x884C;&#x5982;&#x4E0B;&#x547D;&#x4EE4;&#x540E;&#xFF0C;&#x6BCF;&#x6B21;&#x67E5;&#x770B;&#x65F6;&#x7EC8;&#x7AEF;&#x6267;&#x884C; $ git lg &#x5373;&#x53EF;</p>
</li>
</ol>
<p>git config --global alias.lg &quot;log --graph --abbrev-commit --decorate --format=format:&apos;%C(bold blue)%h%C(reset) - %C(bold green)(%ar)%C(reset) %C(white)%s%C(reset) %C(dim white)- %an%C(reset)%C(bold yellow)%d%C(reset)&apos; --all&quot;</p>
<ol>
<li><p>&#x672C;&#x5730;&#x6267;&#x884C;git branch -a&#x67E5;&#x770B;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#x65F6;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4E2D;&#x5DF2;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x5728;&#x672C;&#x5730;&#x6267;&#x884C;&#xFF1A;git pull --prune&#x547D;&#x4EE4;&#x6E05;&#x7406;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4E2D;&#x5DF2;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x5206;&#x652F;</p>
</li>
<li><p>&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x5206;&#x652F;dev&#x62F7;&#x8D1D;&#x6587;&#x4EF6;funset.hpp&#x6216;&#x76EE;&#x5F55;&#x5230;&#x73B0;&#x5728;&#x7684;&#x5206;&#x652F;master&#xFF0C;&#x5219;&#x6267;&#x884C;&#xFF1A;$ git checkout dev funset.hpp ,&#x6267;&#x884C;&#x540E;funset.hpp&#x5728;master&#x5206;&#x652F;&#x4E2D;&#x9ED8;&#x8BA4;&#x662F;&#x6682;&#x5B58;&#x72B6;&#x6001;&#xFF1B;&#x82E5;&#x53D6;&#x6D88;&#x6682;&#x5B58;&#xFF0C;&#x53EF;&#x6267;&#x884C;: $ get reset HEAD</p>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="gitHub、gitee、Pages+Actions打造学习笔记.html" class="navigation navigation-prev " aria-label="Previous page: gitHub、gitee、Pages+Actions打造学习笔记">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Git将一个项目同时从本地推送到GitHub和Gitee.html" class="navigation navigation-next " aria-label="Next page: Git将一个项目同时从本地推送到GitHub和Gitee">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"git命令","level":"1.4","depth":1,"next":{"title":"Git将一个项目同时从本地推送到GitHub和Gitee","level":"1.5","depth":1,"path":"Git将一个项目同时从本地推送到GitHub和Gitee.md","ref":"Git将一个项目同时从本地推送到GitHub和Gitee.md","articles":[]},"previous":{"title":"gitHub、gitee、Pages+Actions打造学习笔记","level":"1.3","depth":1,"path":"gitHub、gitee、Pages+Actions打造学习笔记.md","ref":"gitHub、gitee、Pages+Actions打造学习笔记.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"git命令.md","mtime":"2023-04-19T09:10:25.845Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-04-19T09:11:06.502Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

